CarmelaDA/HomeArt_STM32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *                             
  *---------------------------------- HOMEART ----------------------------------
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include <DHT22.h>
#include <LDR.h>
#include <RFID.h>
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "Buzzer.h"
#include "ESP8266_HAL.h"
#include "LED.h"
#include "RH.h"
#include "SG90.h"
#include "Temperature.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define WiFi_UART &huart2
#define PC_UART &huart6
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;
ADC_HandleTypeDef hadc3;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim5;
TIM_HandleTypeDef htim6;
TIM_HandleTypeDef htim8;
TIM_HandleTypeDef htim9;

UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;
UART_HandleTypeDef huart6;

/* USER CODE BEGIN PV */

volatile int doorbell = 0;
volatile int stop = 0;
volatile int inside = 0;
volatile int outside = 0;

volatile float f_on = 0; 		// Fan ON
volatile float f_off = 0; 		// Fan OFF
volatile float h_on = 0; 		// Heat ON
volatile float h_off = 0; 		// Heat OFF

volatile int rh_min = 0;
volatile int rh_max = 0;

volatile int awning = 0; 		// 1=unfolded 	0=folded
volatile int parcel = 0; 		// 1=opened 	0=closed
volatile int garage = 0; 		// 1=opened 	0=closed
volatile int office = 0; 		// 1=up 		0=down
volatile int bedroom = 0; 		// 1=up 		0=down

volatile int water = 0; 		// 1=on 		0=off
volatile int fan = 0; 			// 1=on 		0=off
volatile int heat = 0; 			// 1=on 		0=off


/*----------- Sensors -----------*/

// Brightness Sensor (LDR)
uint16_t LDR_value = 0;

// Hygrometer (HW-390)
uint16_t Hygro_read = 0;
uint16_t Hygro = 0;

// Rain Sensor
uint16_t Rain_read = 0;
uint16_t Rain = 0;

// Humidity and Temperature Sensor (outside, units, DHT22)
DHT22_DataTypedef DHT22_outside;
int TempOutside = 0;
int RHOutside = 0;

// Humidity and Temperature Sensor (inside, decimals, DHT22)
DHT22_DataTypedef DHT22_inside;
float TempInside = 0;
float RHInside = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_TIM5_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM8_Init(void);
static void MX_TIM9_Init(void);
static void MX_TIM6_Init(void);
static void MX_ADC1_Init(void);
static void MX_ADC2_Init(void);
static void MX_ADC3_Init(void);
static void MX_USART3_UART_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin){

    if (GPIO_Pin==S_In_Pin)
    {
        inside = 1;
    }
    if (GPIO_Pin==S_Out_Pin)
    {
        outside = 1;
    }
}

int debouncer(volatile int* button_int, GPIO_TypeDef* GPIO_port, uint16_t GPIO_number){ // Bounce Control

	static uint8_t button_count=0;
	static int counter=0;

	if (*button_int==1)
	{
		if (button_count==0)
		{
			counter=HAL_GetTick();
			button_count++;
		}
		if (HAL_GetTick()-counter>=20)
		{
			counter=HAL_GetTick();
			if (HAL_GPIO_ReadPin(GPIO_port, GPIO_number)!=1)
			{
				button_count=1;
			}
			else
			{
				button_count++;
			}
			if (button_count==4 ) // Debounce Period
			{
				button_count=0;
				*button_int=0;
				return 1;
			}
		}
	}
	return 0;
}


/*----------- Delay (ms) -----------*/
void delay(uint16_t time){

	__HAL_TIM_SET_COUNTER(&htim6,0);
	while((__HAL_TIM_GET_COUNTER(&htim6))<time);
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  MX_USART6_UART_Init();
  MX_TIM5_Init();
  MX_TIM1_Init();
  MX_TIM4_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  MX_TIM8_Init();
  MX_TIM9_Init();
  MX_TIM6_Init();
  MX_ADC1_Init();
  MX_ADC2_Init();
  MX_ADC3_Init();
  MX_USART3_UART_Init();
  /* USER CODE BEGIN 2 */

  // RGB Gaming LED
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);

  // Parcel Servo
  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);

  // Garage Servo
  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_2);

  // Swning Servo
  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_3);

  // Living Room Servo
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_4);

  // Bedroom Servo
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);

