CarmelaDA/HomeArt_STM32/Core/Src/main.c
  // Office Servo
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_3);

  // Living Room DC Motor
  HAL_TIM_PWM_Start(&htim9, TIM_CHANNEL_1);

  // Buzzer
  HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1);

  /*----------- DHT22 Sensor-----------*/
  HAL_TIM_Base_Start(&htim6);

  /*----------- LDR & HW390 & Rain Initialization  -----------*/
  HAL_ADC_Start(&hadc1); // LDR
  HAL_ADC_Start(&hadc2); // HW-390
  HAL_ADC_Start(&hadc3); // Rain

  //__HAL_UART_ENABLE_IT(&huart2, UART_IT_RXNE);
  ESP_Init("iPhone Carmela","pistacho");

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1){
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

	  	ESP_messageHandler();

		// Vehicle Doorbell
		if(HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_0) == 0){

			int known = readRFID();
			if(known == 1){
				char kn[15] = "OPENING DOOR \n\n";
				HAL_UART_Transmit(&huart6, (uint8_t *) kn, 15, HAL_MAX_DELAY);

				actParcelRFID();
			}
			else if(known == 0){
				char unkn[19] = "CALLING THE BELL \n\n";
				HAL_UART_Transmit(&huart6, (uint8_t *) unkn, 19, HAL_MAX_DELAY);

				playBell();
			}
		}

		// People Doorbell
		if(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13) == 0){

				playBell();
		}

		// Alarm Stop
		if(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_15) == 0){

			__HAL_TIM_SET_COMPARE(&htim4, TIM_CHANNEL_1, 0);
		}

		// Alarm
		if (debouncer(&inside, S_In_GPIO_Port, S_In_Pin)){

			if(vSecurity[0] == '1') playAlarm();
		}
		if (debouncer(&outside, S_Out_GPIO_Port, S_Out_Pin)){

			if(vSecurity[1] == '1') playAlarm();
		}

		// PARCEL DOOR (90)
		if(vWindow[0]=='1' || vOutside[4]=='1') __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, 91);
		if(vWindow[0]=='0' || vOutside[4]=='0') __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, 89);

		// GARAGE DOOR (90)
		if(vWindow[1]=='1' || vGarage[1] == '1') __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_2, 92); // Faster at 30
		if(vWindow[1]=='0' || vGarage[1] == '0') __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_2, 89);

		// CLOTHES LINE AWNING (90)
		if(vOutside[0]=='1'){
			__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_3, 91);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_3, 90);
			awning = 1;
		}
		if(vOutside[0]=='0'){
			__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_3, 88);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_3, 90);
			awning = 0;
		}
		vOutside[0]='x';

		// LIVING ROOM WINDOW (90)
		if(vWindow[2]=='1' || vLiving[5]=='1') {
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_4, 91);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_4, 90);
		}
		if(vWindow[2]=='0'|| vLiving[5]=='0') {
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_4, 89);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_4, 90);
		}
		vWindow[2]='x';
		vLiving[5]='x';

		// BEDROOM WINDOW (90)
		if(vWindow[3]=='1' || vBedroom[3]=='1') {
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, 92);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, 90);
		}
		if(vWindow[3]=='0' || vBedroom[3]=='0') {
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, 89);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, 90);
		}
		vWindow[3]='x';
		vBedroom[3]='x';

		// OFFICE WINDOW (90)
		if(vWindow[4]=='1' || vOffice[11]=='1') {
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_3, 91);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_3, 90);
		}
		if(vWindow[4]=='0' || vOffice[11]=='0') {
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_3, 88);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_3, 90);
		}
		vWindow[4]='x';
		vOffice[11]='x';

		// PARCEL LIMIT SWITCH
		if(HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_6) == 0){

			if (vWindow[0]=='1' || vOutside[4]=='1'){
				__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, 89); // Parcel Servo
				HAL_Delay(1000);
			}
			if (vWindow[0]=='0' || vOutside[4]=='0'){
				__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, 91); // Parcel Servo
				HAL_Delay(1000);
			}
			__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, 90); // Parcel Servo
			vWindow[0]='x'; // Parcel Servo
			vOutside[4]='x'; // Parcel Servo
		}

		// GARAGE LIMIT SWITCH
		if(HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_4) == 0){

			if (vWindow[1]=='1' || vGarage[1]=='1'){
				__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_2, 89); // Garage Servo
				HAL_Delay(1000);
			}
			if (vWindow[1]=='0' || vGarage[1]=='0'){
				__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_2, 92); // Garage Servo
				HAL_Delay(1000);
			}
			__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_2, 90); // Garage Servo
			vWindow[1]='x'; // Garage Servo
			vGarage[1]='x'; // Garage Servo
		}

		// LINVING ROOM FAN
		if(vWeather[0]=='1') {
			__HAL_TIM_SET_COMPARE(&htim9, TIM_CHANNEL_1, 1000);
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_4,GPIO_PIN_SET);
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_5,GPIO_PIN_RESET);
		}
		if(vWeather[0]=='0') {
			__HAL_TIM_SET_COMPARE(&htim9, TIM_CHANNEL_1, 0);
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_4,GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_5,GPIO_PIN_RESET);
		}

		// SETTINGS
		f_on = temp_value(vSettings[0], vSettings[1], vSettings[2]);
		f_off = temp_value(vSettings[3], vSettings[4], vSettings[5]);
		h_on = temp_value(vSettings[6], vSettings[7], vSettings[8]);
		h_off = temp_value(vSettings[9], vSettings[10], vSettings[11]);

		rh_min = rh_value(vSettings[12], vSettings[13]);
		rh_max = rh_value(vSettings[14], vSettings[15]);


		/*----------- Sensor Reading -----------*/

		// LDR
		if(HAL_ADC_PollForConversion(&hadc1, HAL_MAX_DELAY) == HAL_OK)
			LDR_value = HAL_ADC_GetValue(&hadc1);

		ldr(LDR_value);

		// Rain
		if(HAL_ADC_PollForConversion(&hadc3, HAL_MAX_DELAY) == HAL_OK)
			Rain_read = HAL_ADC_GetValue(&hadc3);

		Rain = 100 - ((100*Rain_read)/255);

		if(vOutside[5] == '1'){
			// There are clothes and it is raining (closed awning)
			if (Rain>5 && vOutside[6] == '1' && awning == 0){

				__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_3, 91); // Open awning
				HAL_Delay(3000);
				__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_3, 90);
				awning = 1;
			}

			// There are clothes and it is raining (opened awning)
			// There are not clothes and it is raining (closed awning)

